#### Importing Libs

In [6]:
import pandas as pd
from dotenv import load_dotenv
import os
from SQLeto import SQLeto

#### Load enviroment vars

In [7]:
load_dotenv('..\.env')
DATABASE_EXERCISE = os.getenv('DATABASE_EXERCISE')
USER_EXERCISE = os.getenv('USER_EXERCISE')
PWD_EXERCISE = os.getenv('PWD_EXERCISE')
TABLES_PATH = os.getenv('TABLES_PATH')
PROCESSED_DATA_PATH = os.getenv('PROCESSED_DATA_PATH')

#### Instance SQLeto object

In [8]:
sqleto = SQLeto(DATABASE_EXERCISE, USER_EXERCISE, PWD_EXERCISE)

#### Questão 1:
* Qual é o financiamento total médio de todas as empresas em que tenha trabalhado a
pessoa com ID = **'92a52877-8d5d-41a6-950f-1b9c6574be7a'**?

In [31]:
sqleto.execute_DQL(
    """
    SELECT avg(c.known_total_funding) as total_funding 
    FROM companies as c
    INNER JOIN people as p ON
    c.company_linkedin_names = p.company_li_name
    WHERE p.person_id = '92a52877-8d5d-41a6-950f-1b9c6574be7a';"""
)

   total_funding
0    108000000.0

#### Questão 2:
* Quantas empresas estão na tabela de companies que nenhuma pessoa na tabela de people
tenha trabalhado?

In [16]:
sqleto.execute_DQL('''
    SELECT c.name
    FROM companies c
    LEFT JOIN people p ON p.company_li_name = c.company_linkedin_names
    WHERE p.company_li_name IS NULL
''')

                          name
0             Pepkidz Learning
1                         DRVR
2                   Data Glass
3                  Credo Foods
4                       Pikkap
...                        ...
8989                 Fidem LLC
8990        Service Revolution
8991                    Phelen
8992           Cura Investment
8993  Beeldstijl Ontwerpstudio

[8994 rows x 1 columns]

In [17]:
sqleto.execute_DQL(
    """
    SELECT c.name FROM companies as c
    WHERE NOT EXISTS 
    (SELECT * FROM people as p 
    WHERE c.company_linkedin_names = p.company_li_name
    );
    """)

                          name
0             Pepkidz Learning
1                         DRVR
2                   Data Glass
3                  Credo Foods
4                       Pikkap
...                        ...
8989                 Fidem LLC
8990        Service Revolution
8991                    Phelen
8992           Cura Investment
8993  Beeldstijl Ontwerpstudio

[8994 rows x 1 columns]

#### Questão 3:
* Quais são as dez empresas mais populares para as quais essas 1.000 pessoas
trabalharam?

In [13]:
sqleto.execute_DQL(
    """
    SELECT
    company_name,
    COUNT(company_name) AS value_occurrence

    FROM
    people

    GROUP BY 
    company_name

    ORDER BY 
    value_occurrence  DESC
    LIMIT 10;
    """)

                 company_name  value_occurrence
0                   Microsoft                90
1                      Amazon                81
2           Intel Corporation                55
3                      Google                45
4                       Apple                24
5  Hewlett Packard Enterprise                23
6                    Facebook                21
7           Texas Instruments                19
8             Hewlett-Packard                17
9                        Meta                15